; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-6-31)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p2-0 - location
	p2-4 - location
	p2-5 - location
	p2-6 - location
	p2-7 - location
	p3-0 - location
	p4-0 - location
	p4-1 - location
	p4-2 - location
	p4-3 - location
	p5-1 - location
	p5-3 - location
	p6-0 - location
	p6-5 - location
	p7-5 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s0)
	(at driver5 s7)
	(at driver6 s1)
	(at driver7 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at package1 s3)
	(at package2 s2)
	(at package3 s6)
	(at package4 s1)
	(at package5 s4)
	(at package6 s1)
	(at package7 s6)
	(at package8 s7)
	(at package9 s2)
	(at package10 s0)
	(at package11 s6)
	(at package12 s3)
	(at package13 s1)
	(at package14 s3)
	(at package15 s3)
	(at package16 s7)
	(at package17 s6)
	(at package18 s3)
	(at package19 s2)
	(at package20 s5)
	(at package21 s7)
	(at package22 s1)
	(at package23 s1)
	(at package24 s2)
	(at package25 s6)
	(at package26 s4)
	(at package27 s7)
	(at package28 s5)
	(at package29 s2)
	(at package30 s4)
	(at package31 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s5)
	(link s5 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s6)
	(link s6 s3)
	(link s5 s4)
	(link s4 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s2)
	(link s2 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s3)
	(link s3 s7)
	(link s7 s6)
	(link s6 s7)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s6)
	(at driver5 s1)
	(at driver7 s7)
	(at truck1 s2)
	(at truck2 s4)
	(at truck4 s2)
	(at truck5 s3)
	(at truck6 s6)
	(at package1 s7)
	(at package2 s7)
	(at package3 s0)
	(at package4 s3)
	(at package5 s1)
	(at package6 s5)
	(at package7 s2)
	(at package8 s6)
	(at package9 s5)
	(at package10 s3)
	(at package11 s7)
	(at package12 s1)
	(at package13 s0)
	(at package14 s1)
	(at package15 s6)
	(at package16 s0)
	(at package17 s6)
	(at package18 s6)
	(at package19 s1)
	(at package20 s1)
	(at package21 s0)
	(at package22 s3)
	(at package24 s0)
	(at package27 s2)
	(at package28 s5)
	(at package29 s0)
	(at package30 s6)
	(at package31 s5)
	))


)

; plan
1. (walk driver6 s1 p4-1)
   deleted: (at driver6 s1)
   added: (at driver6 p4-1)
   goals met: 4 of 39
2. (board-truck driver1 s6 truck1)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 39
3. (board-truck driver3 s3 truck4)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 4 of 39
4. (drive-truck driver1 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 4 of 39
5. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 4 of 39
6. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 5 of 39
7. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 5 of 39
8. (load-truck s2 package31 truck1)
   deleted: (at package31 s2)
   added: (in package31 truck1)
   goals met: 5 of 39
9. (load-truck s2 package29 truck1)
   deleted: (at package29 s2)
   added: (in package29 truck1)
   goals met: 5 of 39
10. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 4 of 39
11. (load-truck s1 package6 truck1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 4 of 39
12. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 4 of 39
13. (unload-truck s5 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s5)
   goals met: 5 of 39
14. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 6 of 39
15. (unload-truck s5 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s5)
   goals met: 7 of 39
16. (drive-truck driver1 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 7 of 39
17. (unload-truck s0 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s0)
   goals met: 8 of 39
18. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 8 of 39
19. (load-truck s1 package4 truck1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 8 of 39
20. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 9 of 39
21. (load-truck s2 package24 truck1)
   deleted: (at package24 s2)
   added: (in package24 truck1)
   goals met: 9 of 39
22. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 9 of 39
23. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 8 of 39
24. (drive-truck driver1 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 8 of 39
25. (load-truck s7 package8 truck1)
   deleted: (at package8 s7)
   added: (in package8 truck1)
   goals met: 8 of 39
26. (load-truck s7 package27 truck1)
   deleted: (at package27 s7)
   added: (in package27 truck1)
   goals met: 8 of 39
27. (load-truck s7 package21 truck1)
   deleted: (at package21 s7)
   added: (in package21 truck1)
   goals met: 8 of 39
28. (drive-truck driver1 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 8 of 39
29. (unload-truck s0 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s0)
   goals met: 9 of 39
30. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 10 of 39
31. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 11 of 39
32. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 12 of 39
33. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 12 of 39
34. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 11 of 39
35. (load-truck s0 package10 truck1)
   deleted: (at package10 s0)
   added: (in package10 truck1)
   goals met: 11 of 39
36. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 11 of 39
37. (drive-truck driver1 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 11 of 39
38. (unload-truck s7 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s7)
   goals met: 12 of 39
39. (load-truck s7 package16 truck1)
   deleted: (at package16 s7)
   added: (in package16 truck1)
   goals met: 12 of 39
40. (drive-truck driver1 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 12 of 39
41. (unload-truck s0 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s0)
   goals met: 13 of 39
42. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 13 of 39
43. (load-truck s1 package22 truck1)
   deleted: (at package22 s1)
   added: (in package22 truck1)
   goals met: 13 of 39
44. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 14 of 39
45. (load-truck s4 package5 truck2)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   goals met: 14 of 39
46. (walk driver6 p4-1 s4)
   deleted: (at driver6 p4-1)
   added: (at driver6 s4)
   goals met: 14 of 39
47. (board-truck driver6 s4 truck2)
   deleted: (at driver6 s4) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 14 of 39
48. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 13 of 39
49. (drive-truck driver6 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 12 of 39
50. (unload-truck s6 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s6)
   goals met: 13 of 39
51. (load-truck s6 package7 truck1)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   goals met: 13 of 39
52. (drive-truck driver1 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 14 of 39
53. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 15 of 39
54. (load-truck s5 package20 truck2)
   deleted: (at package20 s5)
   added: (in package20 truck2)
   goals met: 15 of 39
55. (drive-truck driver6 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 15 of 39
56. (unload-truck s1 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 16 of 39
57. (unload-truck s1 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s1)
   goals met: 17 of 39
58. (drive-truck driver6 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 17 of 39
59. (drive-truck driver6 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 18 of 39
60. (load-truck s4 package30 truck2)
   deleted: (at package30 s4)
   added: (in package30 truck2)
   goals met: 18 of 39
61. (load-truck s3 package18 truck4)
   deleted: (at package18 s3)
   added: (in package18 truck4)
   goals met: 18 of 39
62. (drive-truck driver3 s3 s6 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   goals met: 18 of 39
63. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 17 of 39
64. (drive-truck driver6 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 16 of 39
65. (unload-truck s3 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 17 of 39
66. (unload-truck s3 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s3)
   goals met: 18 of 39
67. (load-truck s3 package15 truck1)
   deleted: (at package15 s3)
   added: (in package15 truck1)
   goals met: 18 of 39
68. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 18 of 39
69. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 19 of 39
70. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 18 of 39
71. (unload-truck s1 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s1)
   goals met: 19 of 39
72. (unload-truck s1 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s1)
   goals met: 20 of 39
73. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 21 of 39
74. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 20 of 39
75. (load-truck s3 package12 truck1)
   deleted: (at package12 s3)
   added: (in package12 truck1)
   goals met: 20 of 39
76. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 21 of 39
77. (load-truck s6 package3 truck4)
   deleted: (at package3 s6)
   added: (in package3 truck4)
   goals met: 21 of 39
78. (unload-truck s6 package18 truck4)
   deleted: (in package18 truck4)
   added: (at package18 s6)
   goals met: 22 of 39
79. (load-truck s6 package11 truck4)
   deleted: (at package11 s6)
   added: (in package11 truck4)
   goals met: 22 of 39
80. (drive-truck driver3 s6 s0 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   goals met: 22 of 39
81. (drive-truck driver6 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 22 of 39
82. (unload-truck s6 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s6)
   goals met: 23 of 39
83. (unload-truck s0 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 24 of 39
84. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   goals met: 24 of 39
85. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   goals met: 25 of 39
86. (walk driver4 s0 p6-0)
   deleted: (at driver4 s0)
   added: (at driver4 p6-0)
   goals met: 25 of 39
87. (drive-truck driver6 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 25 of 39
88. (drive-truck driver6 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 26 of 39
89. (walk driver4 p6-0 s6)
   deleted: (at driver4 p6-0)
   added: (at driver4 s6)
   goals met: 27 of 39
90. (walk driver5 s7 p7-5)
   deleted: (at driver5 s7)
   added: (at driver5 p7-5)
   goals met: 27 of 39
91. (walk driver5 p7-5 s5)
   deleted: (at driver5 p7-5)
   added: (at driver5 s5)
   goals met: 27 of 39
92. (walk driver5 s5 p5-1)
   deleted: (at driver5 s5)
   added: (at driver5 p5-1)
   goals met: 27 of 39
93. (walk driver5 p5-1 s1)
   deleted: (at driver5 p5-1)
   added: (at driver5 s1)
   goals met: 28 of 39
94. (walk driver7 s2 p2-7)
   deleted: (at driver7 s2)
   added: (at driver7 p2-7)
   goals met: 28 of 39
95. (walk driver7 p2-7 s7)
   deleted: (at driver7 p2-7)
   added: (at driver7 s7)
   goals met: 29 of 39
96. (board-truck driver4 s6 truck5)
   deleted: (at driver4 s6) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 28 of 39
97. (drive-truck driver4 s6 s3 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   goals met: 29 of 39
98. (load-truck s3 package1 truck5)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   goals met: 29 of 39
99. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 28 of 39
100. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 28 of 39
101. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 29 of 39
102. (drive-truck driver3 s0 s7 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   goals met: 29 of 39
103. (unload-truck s7 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s7)
   goals met: 30 of 39
104. (drive-truck driver3 s7 s0 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s0)
   goals met: 30 of 39
105. (drive-truck driver4 s3 s7 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s7)
   goals met: 29 of 39
106. (unload-truck s7 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s7)
   goals met: 30 of 39
107. (drive-truck driver4 s7 s3 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s3)
   goals met: 31 of 39
108. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 30 of 39
109. (unload-truck s0 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s0)
   goals met: 31 of 39
110. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 31 of 39
111. (unload-truck s1 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s1)
   goals met: 32 of 39
112. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 33 of 39
113. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 32 of 39
114. (unload-truck s3 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 33 of 39
115. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 34 of 39
116. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 33 of 39
117. (unload-truck s6 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s6)
   goals met: 34 of 39
118. (drive-truck driver1 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 35 of 39
119. (drive-truck driver3 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 36 of 39
120. (disembark-truck driver3 s2 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 36 of 39
121. (walk driver3 s2 p2-0)
   deleted: (at driver3 s2)
   added: (at driver3 p2-0)
   goals met: 36 of 39
122. (walk driver3 p2-0 s0)
   deleted: (at driver3 p2-0)
   added: (at driver3 s0)
   goals met: 37 of 39
123. (disembark-truck driver6 s4 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s4) (empty truck2)
   goals met: 37 of 39
124. (walk driver6 s4 p4-1)
   deleted: (at driver6 s4)
   added: (at driver6 p4-1)
   goals met: 37 of 39
125. (walk driver6 p4-1 s1)
   deleted: (at driver6 p4-1)
   added: (at driver6 s1)
   goals met: 37 of 39
126. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 36 of 39
127. (disembark-truck driver1 s1 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 37 of 39
128. (board-truck driver6 s1 truck1)
   deleted: (at driver6 s1) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 37 of 39
129. (drive-truck driver6 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 38 of 39
130. (disembark-truck driver6 s2 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s2) (empty truck1)
   goals met: 38 of 39
131. (walk driver6 s2 p2-6)
   deleted: (at driver6 s2)
   added: (at driver6 p2-6)
   goals met: 38 of 39
132. (walk driver6 p2-6 s6)
   deleted: (at driver6 p2-6)
   added: (at driver6 s6)
   goals met: 38 of 39
133. (drive-truck driver4 s3 s6 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   goals met: 37 of 39
134. (disembark-truck driver4 s6 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s6) (empty truck5)
   goals met: 38 of 39
135. (board-truck driver6 s6 truck5)
   deleted: (at driver6 s6) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 38 of 39
136. (drive-truck driver6 s6 s3 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   goals met: 39 of 39
